@@오늘도 SQL
//부서 번호가 20인 사람 다 출력
SELECT * FROM EMP
WHERE DEPTNO = 20 OR DEPTNO = 10;


----------------------------------------------------------------------------------------------
//EMP 테이블에서 급여가 1500 이상 3000인 직원정보
SELECT * FROM EMP
WHERE SAL BETWEEN 1500 AND 3000;


----------------------------------------------------------------------------------------------
//조회
SELECT ENAME "이름", SAL "월급" FROM EMP;


----------------------------------------------------------------------------------------------
//전체 직원 중에 'CLERK', 'SALESMAN'이 아닌 모든 직원 데이터를 출력
SELECT * FROM EMP
WHERE JOB <>'CLERK' -- <>RHK !=은 같은 표현 ~~가 닌
AND JOB != 'SALESMAN';

[한줄로 SELECT * FROM EMP WHERE JOB NOT IN ('CLERK', 'SALESMAN'); <- 이렇게 해도 된다.
----------------------------------------------------------------------------------------------
//이름이 S로 시작하는 데이터를 출력
SELECT * FROM EMP WHERE ENAME LIKE 'S%';


----------------------------------------------------------------------------------------------
//이름이 S로 끝나는 데이터를 출력
SELECT * FROM EMP WHERE ENAME LIKE '%S';


----------------------------------------------------------------------------------------------
//이름이 S이 들어가는 데이터를 출력
SELECT * FROM EMP WHERE ENAME LIKE '%S%';

 
----------------------------------------------------------------------------------------------
//


----------------------------------------------------------------------------------------------
//
